#!/bin/bash

LOG_FILE="logFileByCpt.log"

log()
{
echo "$(date '+%F %H:%M:%S') --- $1" >> $LOG_FILE
}

log "Скрипт 2. Создание тегов и управление версиями."

# скрипт запущен с одним параметром (хэш-коммита)

if [[ $# -eq 1 ]]; then

log "скрипт запущен с одним параметром (хэш коммита)"

COMMIT_HASH=$1

read -p "Введите номер версии для тега: " VERSION_NUMBER

read -p "Введите сообщение для тега: " TAG_MESSAGE

git switch master

log "создание аннотированного тега "$VERSION_NUMBER" для коммита "$COMMIT_HASH" с сообщением "$TAG_MESSAGE""

if ! git tag -a "$VERSION_NUMBER" "$COMMIT_HASH" -m "$TAG_MESSAGE"; then
    log "Не удалось создать аннотированный тег"
    echo "Ошибка создания аннотированного тега"
else

log "Аннотированный тег для коммита $COMMIT_HASH создан"
echo "Аннотированный тег для коммита $COMMIT_HASH создан"

git tag

fi

if ! git push origin "$VERSION_NUMBER"; then
    log "Ошибка при отправке тега на удаленный репозиторий"
    echo "Ошибка при отправке тега на удаленный репозиторий"
else
    log "Тег "$VERSION_NUMBER" успешно запушен на удаленный репозиторий"
    echo "Тег успешно запушен на удаленный репозиторий"
    log "Скрипт завершен успешно."
    log "------------------------"
fi

# скрипт запущен без параметров

elif [[ $# -eq 0 ]]; then

log "скрипт запущен без параметров"

read -p "Введите номер версии для тега: " VERSION_NUMBER

read -p "Введите сообщение для тега: " TAG_MESSAGE

echo "переключение на ветку master..."

git switch master

log "создание аннотированного тега "$VERSION_NUMBER" для коммита "$COMMIT_HASH" с сообщением "$TAG_MESSAGE""

if ! git tag -a "$VERSION_NUMBER" "$COMMIT_HASH" -m "$TAG_MESSAGE"; then
    log "Не удалось создать аннотированный тег"
    echo "Ошибка создания аннотированного тега"
else

log "Аннотированный тег для коммита $COMMIT_HASH создан"
echo "Аннотированный тег для коммита $COMMIT_HASH создан"

git tag
fi

if ! git push origin "$VERSION_NUMBER"; then
    log "Ошибка при отправке тега на удаленный репозиторий"
    echo "Ошибка при отправке тега на удаленный репозиторий"
else
    log "Тег "$VERSION_NUMBER" успешно запушен на удаленный репозиторий"
    echo "Тег успешно запушен на удаленный репозиторий"
    log "Скрипт завершен успешно."
    log "------------------------"
fi

else

echo "Вы ввели неверное кол-во параметров для скрипта. Запустите скрипт без параметров или с одним параметром,
 предсатвляющим собой хэш коммита, для которого будет создан тег."

fi